## Stacking and Unstacking using Pandas

In [3]:
row_level0_label = ["tata", "Birla", "Wipro", "TCS"]
row_level1_label = ["Tech", "FCMG"]
col_list1 = [2022, 2023]
col_list2 = ["Q1", "Q2"]

In [2]:
import numpy as np
import pandas as pd

np.random.seed(23)
n84 = np.arange(2000, 2032).reshape(8,4)

In [9]:
row_labels = pd.MultiIndex.from_product([row_level0_label, row_level1_label])
col_lables = pd.MultiIndex.from_product([col_list1, col_list2])

df = pd.DataFrame(n84, index=row_labels, columns=col_lables)
df

            2022        2023
              Q1    Q2    Q1    Q2
tata  Tech  2000  2001  2002  2003
      FCMG  2004  2005  2006  2007
Birla Tech  2008  2009  2010  2011
      FCMG  2012  2013  2014  2015
Wipro Tech  2016  2017  2018  2019
      FCMG  2020  2021  2022  2023
TCS   Tech  2024  2025  2026  2027
      FCMG  2028  2029  2030  2031

In [15]:
df.loc[("Birla", "FCMG"), (2022, "Q2")]

2013

In [11]:
df.stack(level=0)

                   Q1    Q2
tata  Tech 2022  2000  2001
           2023  2002  2003
      FCMG 2022  2004  2005
           2023  2006  2007
Birla Tech 2022  2008  2009
           2023  2010  2011
      FCMG 2022  2012  2013
           2023  2014  2015
Wipro Tech 2022  2016  2017
           2023  2018  2019
      FCMG 2022  2020  2021
           2023  2022  2023
TCS   Tech 2022  2024  2025
           2023  2026  2027
      FCMG 2022  2028  2029
           2023  2030  2031

In [12]:
df.unstack(level=1)

       2022                    2023
         Q1          Q2          Q1          Q2
       FCMG  Tech  FCMG  Tech  FCMG  Tech  FCMG  Tech
Birla  2012  2008  2013  2009  2014  2010  2015  2011
TCS    2028  2024  2029  2025  2030  2026  2031  2027
Wipro  2020  2016  2021  2017  2022  2018  2023  2019
tata   2004  2000  2005  2001  2006  2002  2007  2003

In [13]:
df.stack(level=0).unstack(level=0).unstack(level=0)

        Q1                                              Q2                    \
     Birla         TCS       Wipro        tata       Birla         TCS
      FCMG  Tech  FCMG  Tech  FCMG  Tech  FCMG  Tech  FCMG  Tech  FCMG  Tech
2022  2012  2008  2028  2024  2020  2016  2004  2000  2013  2009  2029  2025
2023  2014  2010  2030  2026  2022  2018  2006  2002  2015  2011  2031  2027


     Wipro        tata
      FCMG  Tech  FCMG  Tech
2022  2021  2017  2005  2001
2023  2023  2019  2007  2003

In [14]:
df.stack(level=0).unstack(level=0).unstack(level=0).stack(1)

              Q1          Q2
            FCMG  Tech  FCMG  Tech
2022 Birla  2012  2008  2013  2009
     TCS    2028  2024  2029  2025
     Wipro  2020  2016  2021  2017
     tata   2004  2000  2005  2001
2023 Birla  2014  2010  2015  2011
     TCS    2030  2026  2031  2027
     Wipro  2022  2018  2023  2019
     tata   2006  2002  2007  2003

In [16]:
df

            2022        2023
              Q1    Q2    Q1    Q2
tata  Tech  2000  2001  2002  2003
      FCMG  2004  2005  2006  2007
Birla Tech  2008  2009  2010  2011
      FCMG  2012  2013  2014  2015
Wipro Tech  2016  2017  2018  2019
      FCMG  2020  2021  2022  2023
TCS   Tech  2024  2025  2026  2027
      FCMG  2028  2029  2030  2031

In [19]:
df.stack(level=1) # updates the dataframe with given column level into row level
# here the level 1 columns Q1 and Q2 are transformed inot rows by making one level column i.e year
# and Unstacking works opposite of stacking process with row index

               2022  2023
tata  Tech Q1  2000  2002
           Q2  2001  2003
      FCMG Q1  2004  2006
           Q2  2005  2007
Birla Tech Q1  2008  2010
           Q2  2009  2011
      FCMG Q1  2012  2014
           Q2  2013  2015
Wipro Tech Q1  2016  2018
           Q2  2017  2019
      FCMG Q1  2020  2022
           Q2  2021  2023
TCS   Tech Q1  2024  2026
           Q2  2025  2027
      FCMG Q1  2028  2030
           Q2  2029  2031

### Concat

In [21]:
df1 = pd.read_csv("../lds_files/lds11.csv")
df2 = pd.read_csv("../lds_files/lds12.csv")
df3 = pd.read_csv("../lds_files/lds13.csv")

print(df1)
print(df2)
print(df3)

                 Vol    Rev  Exp Sector  EmpCnt
Kolkata_FMCG     900  874.4  676    Pub    1379
NCR_Leagles      931  863.5  605    Pub    1935
Bombay_Sporting  975  839.8  615    Pvt     154
                   Vol    Rev  Exp Sector   HQ
Bombay_Sporting    925  839.8  715    Pvt  Mum
Bombay_Finance     899  917.0  674    Pub  Mum
Bangalore_Systems  931  881.6  650    Gov  Blr
Chennai_Shipping   992  821.0  665    Pub  Che
                     Vol    Rev  Exp Sector  EmpCnt   HQ
Bangalore_Breweries  966  805.0  895    Pvt     119  Blr
Chennai_Chemicals    966  863.2  608    Pub    1656  Che
Indi_Services        954  733.0  609    Gov   13023  NCR

In [23]:
dfc1 = pd.concat(objs=(df1,df2), axis=0, join="outer", keys=None)
dfc1

                   Vol    Rev  Exp Sector  EmpCnt   HQ
Kolkata_FMCG       900  874.4  676    Pub  1379.0  NaN
NCR_Leagles        931  863.5  605    Pub  1935.0  NaN
Bombay_Sporting    975  839.8  615    Pvt   154.0  NaN
Bombay_Sporting    925  839.8  715    Pvt     NaN  Mum
Bombay_Finance     899  917.0  674    Pub     NaN  Mum
Bangalore_Systems  931  881.6  650    Gov     NaN  Blr
Chennai_Shipping   992  821.0  665    Pub     NaN  Che

In [24]:
dfc1.index

Index(['Kolkata_FMCG', 'NCR_Leagles', 'Bombay_Sporting', 'Bombay_Sporting',
       'Bombay_Finance', 'Bangalore_Systems', 'Chennai_Shipping'],
      dtype='object')

In [25]:
dfc2 = pd.concat(objs=(df1,df2), axis=0, join="inner", keys=["F11", "F12"])
dfc2

                       Vol    Rev  Exp Sector
F11 Kolkata_FMCG       900  874.4  676    Pub
    NCR_Leagles        931  863.5  605    Pub
    Bombay_Sporting    975  839.8  615    Pvt
F12 Bombay_Sporting    925  839.8  715    Pvt
    Bombay_Finance     899  917.0  674    Pub
    Bangalore_Systems  931  881.6  650    Gov
    Chennai_Shipping   992  821.0  665    Pub

In [30]:
dfc2 = pd.concat(objs=(df1,df2), axis=1, join="outer", keys=["F11", "F12"])
dfc2

                     F11                                 F12                \
                     Vol    Rev    Exp Sector  EmpCnt    Vol    Rev    Exp
Kolkata_FMCG       900.0  874.4  676.0    Pub  1379.0    NaN    NaN    NaN
NCR_Leagles        931.0  863.5  605.0    Pub  1935.0    NaN    NaN    NaN
Bombay_Sporting    975.0  839.8  615.0    Pvt   154.0  925.0  839.8  715.0
Bombay_Finance       NaN    NaN    NaN    NaN     NaN  899.0  917.0  674.0
Bangalore_Systems    NaN    NaN    NaN    NaN     NaN  931.0  881.6  650.0
Chennai_Shipping     NaN    NaN    NaN    NaN     NaN  992.0  821.0  665.0


                  Sector   HQ
Kolkata_FMCG         NaN  NaN
NCR_Leagles          NaN  NaN
Bombay_Sporting      Pvt  Mum
Bombay_Finance       Pub  Mum
Bangalore_Systems    Gov  Blr
Chennai_Shipping     Pub  Che

In [31]:
dfc3 = pd.concat(objs=(df1,df2, df3), axis=1, join="outer", keys=["F11", "F12"])
dfc3

C:\Users\lokesh\AppData\Local\Temp\ipykernel_40244\3874318101.py:1: FutureWarning: The behavior of pd.concat with len(keys) != len(objs) is deprecated. In a future version this will raise instead of truncating to the smaller of the two sequences
  dfc3 = pd.concat(objs=(df1,df2, df3), axis=1, join="outer", keys=["F11", "F12"])

                     F11                                 F12                \
                     Vol    Rev    Exp Sector  EmpCnt    Vol    Rev    Exp
Kolkata_FMCG       900.0  874.4  676.0    Pub  1379.0    NaN    NaN    NaN
NCR_Leagles        931.0  863.5  605.0    Pub  1935.0    NaN    NaN    NaN
Bombay_Sporting    975.0  839.8  615.0    Pvt   154.0  925.0  839.8  715.0
Bombay_Finance       NaN    NaN    NaN    NaN     NaN  899.0  917.0  674.0
Bangalore_Systems    NaN    NaN    NaN    NaN     NaN  931.0  881.6  650.0
Chennai_Shipping     NaN    NaN    NaN    NaN     NaN  992.0  821.0  665.0


                  Sector   HQ
Kolkata_FMCG         NaN  NaN
NCR_Leagles          NaN  NaN
Bombay_Sporting      Pvt  Mum
Bombay_Finance       Pub  Mum
Bangalore_Systems    Gov  Blr
Chennai_Shipping     Pub  Che

### Merging Dataframe

In [3]:
df21 = pd.read_csv("../lds_files/lds21.csv")
df22 = pd.read_csv("../lds_files/lds22.csv")
df23 = pd.read_csv("../lds_files/lds23.csv")

print(df21)
print(df22)
print(df23)

                    stock_id   HQ  high
Bangalore_Breweries     BREW  Blr  1100
Chennai_Shipping        SHIP  Che  1200
Kolkata_FMCG            KFMC  Kol  2000
NCR_Leagles             NCRL  NCR  1200
                    stock_name   HQ  vol
Bangalore_Breweries       BREW  Blr  350
Bombay_Finance            BFIN  Mum  450
Chennai_Chemicals         CHEM  Che  550
Kolkata_FMCG              KFMC  Kol  500
                    stock_name   HQ  empcnt
Chennai_Shipping          SHIP  Che   10000
Bangalore_Breweries       BREW  Blr    5000
Bombay_Finance            BFIN  Mum   30000
Bangalore_Systems         BSYS  Blr   20000

In [4]:
dfm1 = pd.merge(df21, df22) # it will analyse the data and picks the common column on them
dfm1

  stock_id   HQ  high stock_name  vol
0     BREW  Blr  1100       BREW  350
1     SHIP  Che  1200       CHEM  550
2     KFMC  Kol  2000       KFMC  500

In [7]:
dfm1 = pd.merge(left=df21, right=df22, how="inner", on="HQ", indicator=True)
dfm1 # during the merging the index labels will be trucated, since they cannot be categoried with this data frames for example 
# the value che is in both the table but their index labels are diffrent because of this index labels will be trucated

  stock_id   HQ  high stock_name  vol _merge
0     BREW  Blr  1100       BREW  350   both
1     SHIP  Che  1200       CHEM  550   both
2     KFMC  Kol  2000       KFMC  500   both

In [8]:
dfm1 = pd.merge(left=df21, right=df22, how="outer", on="HQ", indicator=True)
dfm1

  stock_id   HQ    high stock_name    vol      _merge
0     BREW  Blr  1100.0       BREW  350.0        both
1     SHIP  Che  1200.0       CHEM  550.0        both
2     KFMC  Kol  2000.0       KFMC  500.0        both
3     NCRL  NCR  1200.0        NaN    NaN   left_only
4      NaN  Mum     NaN       BFIN  450.0  right_only

In [11]:
dfm1 = pd.merge(left=df21, right=df22, how="cross", on="HQ", indicator=True)
dfm1 # cross join will not take the on parameter as it will create fresh set of df with every column, as it gives 9X9 if given both are 3X3

MergeError: Can not pass on, right_on, left_on or set right_index=True or left_index=True

In [10]:
dfm1 = pd.merge(left=df21, right=df22, how="cross", indicator=True)
dfm1

   stock_id HQ_x  high stock_name HQ_y  vol _merge
0      BREW  Blr  1100       BREW  Blr  350   both
1      BREW  Blr  1100       BFIN  Mum  450   both
2      BREW  Blr  1100       CHEM  Che  550   both
3      BREW  Blr  1100       KFMC  Kol  500   both
4      SHIP  Che  1200       BREW  Blr  350   both
5      SHIP  Che  1200       BFIN  Mum  450   both
6      SHIP  Che  1200       CHEM  Che  550   both
7      SHIP  Che  1200       KFMC  Kol  500   both
8      KFMC  Kol  2000       BREW  Blr  350   both
9      KFMC  Kol  2000       BFIN  Mum  450   both
10     KFMC  Kol  2000       CHEM  Che  550   both
11     KFMC  Kol  2000       KFMC  Kol  500   both
12     NCRL  NCR  1200       BREW  Blr  350   both
13     NCRL  NCR  1200       BFIN  Mum  450   both
14     NCRL  NCR  1200       CHEM  Che  550   both
15     NCRL  NCR  1200       KFMC  Kol  500   both

In [14]:
dfm1 = pd.merge(left=df22, right=df23, how="inner", on=["stock_name", "HQ"], indicator=True)
dfm1

  stock_name   HQ  vol  empcnt _merge
0       BREW  Blr  350    5000   both
1       BFIN  Mum  450   30000   both

In [15]:
dfm1 = pd.merge(left=df21, right=df22, how="inner", left_on="stock_id", right_on="stock_name", indicator=True)
dfm1

  stock_id HQ_x  high stock_name HQ_y  vol _merge
0     BREW  Blr  1100       BREW  Blr  350   both
1     KFMC  Kol  2000       KFMC  Kol  500   both

In [16]:
dfm1 = pd.merge(left=df21, right=df22, how="inner", left_on="stock_id", right_on="stock_name", left_index=True, indicator=True)
dfm1

MergeError: Can only pass argument "left_on" OR "left_index" not both.

In [24]:
dfm1 = pd.merge(left=df21, right=df22, how="inner", left_index=True, right_index=True, indicator=True)
dfm1

                    stock_id HQ_x  high stock_name HQ_y  vol _merge
Bangalore_Breweries     BREW  Blr  1100       BREW  Blr  350   both
Kolkata_FMCG            KFMC  Kol  2000       KFMC  Kol  500   both